In [1]:
import pandas as pd

### Loading Data

In [2]:
df = pd.read_csv('examples/ex1.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
# Using read_table
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_table('examples/ex2.csv', sep=',', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [12]:
df2 = pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

In [13]:
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
df3 = pd.read_csv('examples/ex3.csv')

In [15]:
df3

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [16]:
pd.isnull(df3)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [17]:
pd.notnull(df3)

   something     a     b      c     d  message
0       True  True  True   True  True    False
1       True  True  True  False  True     True
2       True  True  True   True  True     True

In [19]:
df4 = pd.read_csv('examples/ex3.csv', na_values=['NULL'])

In [20]:
df4

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
# Generatig random numbers
import numpy as np
values = np.random.randn(4,5)
values

array([[ 0.20426679, -0.10276802,  1.13254245, -0.49294646,  0.3014465 ],
       [ 0.61431566,  0.38116288, -0.10863382, -0.88911744,  0.3206815 ],
       [ 0.18154558,  0.28293715, -0.32057763, -1.95421316,  0.57290446],
       [ 1.5984931 , -0.93138446, -1.24554347, -0.15746234,  0.45484732]])

### Reading Text Files in Pieces

In [28]:
result = pd.read_csv('examples/ex4.csv')

In [29]:
result

   -1.49853103  1.04302842  0.11678855  -0.35733853  -0.47373626  L
0    -1.039274    1.569238   -0.790402    -0.291814    -0.698779  B
1    -0.439555   -0.239966   -1.100690    -1.639059     0.345985  G
2     0.034436    1.136282    0.291270     1.087806    -0.393276  R

In [53]:
result = pd.read_csv('examples/ex4.csv')

In [54]:
result

        one       two     three      four      five key
0 -1.498531  1.043028  0.116789 -0.357339 -0.473736   L
1 -1.039274  1.569238 -0.790402 -0.291814 -0.698779   B
2 -0.439555 -0.239966 -1.100690 -1.639059  0.345985   G
3  0.034436  1.136282  0.291270  1.087806 -0.393276   R

In [55]:
chunker = pd.read_csv('examples/ex4.csv', chunksize=50)

In [56]:
chunker

In [57]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

/tmp/ipykernel_3415/1290566473.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [59]:
tot[:25]

L    1.0
B    1.0
G    1.0
R    1.0
dtype: float64

### Writing Data to Text Format

In [63]:
data = pd.read_csv('examples/ex1.csv')

In [64]:
data.to_csv('examples/out.csv', header=None)

In [62]:
import sys
data.to_csv(sys.stdout, sep='|')

|a|b|c|d|message
0|1|2|3|4|hello
1|5|6|7|8|world
2|9|10|11|12|foo